#+title: Sinatra with activerecord
#+subtitle: small json server apps
#+tags[]: ruby, sinatra, activerecord
#+date: 2023-09-30T11:46:21

I want to build a very simple sinatra app, but I also want it to
connect to the database.  Here is the walk through for how to have a
very base install, which includes migrations.

The final code is available at [[https://github.com/wschenk/sinatra-ar-template][wschenk/sinatra-ar-template]].

** Database
Let's add a model, for example =post=

#+begin_src bash
  rake db:create_migration post
#+end_src

#+RESULTS:
: db/migrate/20230930213922_post.rb

Then we can add our fields to it to it

#+begin_src ruby :tangle db/migrate/20230930213922_post.rb
  class Post < ActiveRecord::Migration[7.0]
    def change
      create_table :posts do |t|
        t.string :name
        t.text :body
        t.timestamps
      end
    end
  end
#+end_src

Then create the table

#+begin_src bash :results output code
rake db:migrate
#+end_src

#+RESULTS:
#+begin_src bash
== 20230930213922 Post: migrating =============================================
-- create_table(:posts)
   -> 0.0003s
== 20230930213922 Post: migrated (0.0003s) ====================================

#+end_src

And we can verify that it's there

#+begin_src bash :results output code
  echo .schema posts | \
      sqlite3 db/development.sqlite3 | \
      fold -w 80 -s
#+end_src

#+RESULTS:
#+begin_src bash
CREATE TABLE IF NOT EXISTS "posts" ("id" integer PRIMARY KEY AUTOINCREMENT NOT 
NULL, "name" varchar, "body" text, "created_at" datetime(6) NOT NULL, 
"updated_at" datetime(6) NOT NULL);
#+end_src
* Adding a password

Lets see how to add authentication.

#+begin_src bash
  bundle add bcrypt --version '~> 3.1.7'
#+end_src

Create the migration and run it:

#+begin_src bash
  rake db:create_migration account
#+end_src

#+RESULTS:
: db/migrate/20230930221648_account.rb

#+begin_src ruby :tangle db/migrate/20230930221648_account.rb
  class Account < ActiveRecord::Migration[7.0]
    def change
      create_table :accounts do |t|
        t.string :name
        t.string :password_digest
      end
    end
  end
#+end_src

#+begin_src bash :results output code
rake db:migrate
#+end_src

#+RESULTS:
#+begin_src bash
== 20230930221648 Account: migrating ==========================================
== 20230930221648 Account: migrated (0.0000s) =================================

#+end_src

